
## Plan Result (koyashiro.net)

[CI link](https://github.com/koyashiro/infra/actions/runs/8799968267)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.cname_cdn


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.cname_cdn will be created
  + resource "cloudflare_record" "cname_cdn" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cdn"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "cdn-koyashiro.pages.dev"
      + zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":177,"Program":"tfcmt","SHA1":"9285d96395a9814fe578f471b12c345a42081c53","Target":"koyashiro.net","Vars":{},"WorkflowName":"terraform"} -->